kebasaa/datalogger_esp8266/src/dl_core.h
#pragma once
// ============================================================================
//  Datalogger framework internals: CSV/time/RTC/heap helpers, I2C+GPS recovery, WiFi/MQTT callbacks
//  Auto-relocated verbatim from the old monolithic main.cpp. Included ONLY by
//  datalogger.h (one translation unit). Beginners never need to open this.
// ============================================================================

void csv_init(CsvBuffer& csv, char* buf, size_t size) {
  csv.buf = buf;
  csv.size = size;
  csv.len = 0;
  csv.truncated = false;
  if (size > 0) csv.buf[0] = '\0';
}

void csv_append_raw(CsvBuffer& csv, const char* text) {
  if (csv.len >= csv.size) {
    csv.truncated = true;
    return;
  }
  int written = snprintf(csv.buf + csv.len, csv.size - csv.len, "%s", text ? text : "");
  if (written < 0 || (size_t)written >= csv.size - csv.len) {
    csv.len = csv.size - 1;
    csv.buf[csv.len] = '\0';
    csv.truncated = true;
  } else {
    csv.len += (size_t)written;
  }
}

void csv_appendf(CsvBuffer& csv, const char* fmt, ...) {
  if (csv.len >= csv.size) {
    csv.truncated = true;
    return;
  }
  va_list args;
  va_start(args, fmt);
  int written = vsnprintf(csv.buf + csv.len, csv.size - csv.len, fmt, args);
  va_end(args);
  if (written < 0 || (size_t)written >= csv.size - csv.len) {
    csv.len = csv.size - 1;
    csv.buf[csv.len] = '\0';
    csv.truncated = true;
  } else {
    csv.len += (size_t)written;
  }
}

void csv_field(CsvBuffer& csv, const char* text) {
  csv_append_raw(csv, text);
  csv_append_raw(csv, ",");
}

void csv_uint(CsvBuffer& csv, uint32_t value) {
  csv_appendf(csv, "%lu,", (unsigned long)value);
}

void csv_int(CsvBuffer& csv, int value) {
  csv_appendf(csv, "%d,", value);
}

void csv_float(CsvBuffer& csv, float value, uint8_t decimals = 2) {
  if (isnan(value) || isinf(value)) {
    csv_append_raw(csv, ",");
  } else {
    char tmp[24];
    dtostrf(value, 0, decimals, tmp);
    csv_append_raw(csv, tmp);
    csv_append_raw(csv, ",");
  }
}

void sanitize_csv_text(const String& src, char* dst, size_t dst_size) {
  if (dst_size == 0) return;
  size_t j = 0;
  for (size_t i = 0; i < src.length() && j < dst_size - 1; i++) {
    char c = src.charAt(i);
    dst[j++] = (c == ',' || c == '\r' || c == '\n') ? ' ' : c;
  }
  dst[j] = '\0';
}

bool is_leap_year(uint16_t year) {
  return ((year % 4 == 0) && (year % 100 != 0)) || (year % 400 == 0);
}

uint8_t days_in_month(uint16_t year, uint8_t month) {
  static const uint8_t days[] = {31,28,31,30,31,30,31,31,30,31,30,31};
  if (month == 2 && is_leap_year(year)) return 29;
  if (month < 1 || month > 12) return 31;
  return days[month - 1];
}

uint32_t utc_to_epoch(uint16_t year, uint8_t month, uint8_t day, uint8_t hour, uint8_t minute, uint8_t second) {
  uint32_t days = 0;
  for (uint16_t y = 1970; y < year; y++) days += is_leap_year(y) ? 366UL : 365UL;
  for (uint8_t m = 1; m < month; m++) days += days_in_month(year, m);
  days += (uint32_t)(day - 1);
  return days * 86400UL + (uint32_t)hour * 3600UL + (uint32_t)minute * 60UL + second;
}

void epoch_to_utc(uint32_t epoch, uint16_t& year, uint8_t& month, uint8_t& day, uint8_t& hour, uint8_t& minute, uint8_t& second) {
  uint32_t days = epoch / 86400UL;
  uint32_t rem = epoch % 86400UL;
  hour = rem / 3600UL;
  rem %= 3600UL;
  minute = rem / 60UL;
  second = rem % 60UL;
  year = 1970;
  while (true) {
    uint16_t year_days = is_leap_year(year) ? 366 : 365;
    if (days < year_days) break;
    days -= year_days;
    year++;
  }
  month = 1;
  while (true) {
    uint8_t month_days = days_in_month(year, month);
    if (days < month_days) break;
    days -= month_days;
    month++;
  }
  day = days + 1;
}

void format_utc_timestamp(uint32_t epoch, char* dst, size_t dst_size) {
  uint16_t year;
  uint8_t month, day, hour, minute, second;
  epoch_to_utc(epoch, year, month, day, hour, minute, second);
  snprintf(dst, dst_size, "%04u-%02u-%02u %02u:%02u:%02u",
           (unsigned)year, (unsigned)month, (unsigned)day,
           (unsigned)hour, (unsigned)minute, (unsigned)second);
}

void format_utc_date(uint32_t epoch, char* dst, size_t dst_size) {
  uint16_t year;
  uint8_t month, day, hour, minute, second;
  epoch_to_utc(epoch, year, month, day, hour, minute, second);
  snprintf(dst, dst_size, "%04u%02u%02u", (unsigned)year, (unsigned)month, (unsigned)day);
}

uint32_t rtc_record_crc(const RtcRestartRecord& record) {
  return record.magic ^ record.version ^ record.epoch ^ record.sample_counter ^ record.reason ^ 0xA5A55A5AUL;
}

bool read_rtc_restart_record(RtcRestartRecord& record) {
#if defined(ARDUINO_ARCH_ESP8266)
  if (!ESP.rtcUserMemoryRead(RTC_RESTART_OFFSET, (uint32_t*)&record, sizeof(record))) return false;
  if (record.magic != RTC_RESTART_MAGIC || record.version != RTC_RESTART_VERSION) return false;
  if (record.crc != rtc_record_crc(record)) return false;
  uint16_t year;
  uint8_t month, day, hour, minute, second;
  epoch_to_utc(record.epoch, year, month, day, hour, minute, second);
  return year >= GPS_YEAR_MIN && year <= GPS_YEAR_MAX;
#else
  (void)record;
  return false;
#endif
}

void write_rtc_restart_record(uint32_t epoch, uint32_t reason) {
#if defined(ARDUINO_ARCH_ESP8266)
  if (epoch == 0) return;
  RtcRestartRecord record;
  record.magic = RTC_RESTART_MAGIC;
  record.version = RTC_RESTART_VERSION;
  record.epoch = epoch;
  record.sample_counter = sample_counter;
  record.reason = reason;
  record.crc = rtc_record_crc(record);
  ESP.rtcUserMemoryWrite(RTC_RESTART_OFFSET, (uint32_t*)&record, sizeof(record));
#else
  (void)epoch;
  (void)reason;
#endif
}

uint32_t gps_epoch_now() {
#if USE_GPS
  return utc_to_epoch(gps.year(), gps.month(), gps.day(), gps.hour(), gps.minute(), gps.second());
#else
  return 0;
#endif
}

bool is_gps_epoch_sane(uint32_t gps_epoch, uint32_t now_ms) {
  if (gps_epoch == 0) return false;
  uint16_t year;
  uint8_t month, day, hour, minute, second;
  epoch_to_utc(gps_epoch, year, month, day, hour, minute, second);
  if (year < GPS_YEAR_MIN || year > GPS_YEAR_MAX) return false;
  // The jump check exists to reject a GPS reading that disagrees wildly with a
  // clock we already trust. A hand-entered clock is NOT one we trust more than
  // GPS: measuring the fix against it would mean a phone set a week wrong
  // rejects the real time forever, which is the precise opposite of what the
  // manual clock is for. So skip the comparison while the anchor is manual - the
  // year window above still applies.
  if (last_fresh_gps_epoch_valid && !manual_time_active) {
    uint32_t expected_epoch = last_fresh_gps_epoch + ((now_ms - last_fresh_gps_millis) / 1000UL);
    uint32_t delta = gps_epoch > expected_epoch ? gps_epoch - expected_epoch : expected_epoch - gps_epoch;
    if (delta > GPS_MAX_TIME_JUMP_SECONDS) return false;
  }
  return true;
}

uint32_t calculated_timestamp_epoch(bool gps_time_fresh, bool gps_time_sane_now, uint32_t now_ms, const char** source) {
#if USE_GPS
  if (gps_time_fresh && gps_time_sane_now) {
    uint32_t gps_epoch = gps_epoch_now();
    // GPS has just taken over from a clock that was set by hand. Work out how far
    // out that clock had drifted before overwriting it, so the correction can be
    // reported once - it is the only way to know after the fact whether the data
    // logged on the manual clock carries a meaningful timestamp error.
    if (manual_time_active) {
      uint32_t was = last_fresh_gps_epoch + ((now_ms - last_fresh_gps_millis) / 1000UL);
      manual_time_jump_s = (long)gps_epoch - (long)was;
      manual_time_jump_pending = true;
      manual_time_active = false;
    }
    last_fresh_gps_epoch = gps_epoch;
    last_fresh_gps_millis = now_ms;
    last_fresh_gps_epoch_valid = true;
    strncpy(boot_time_source_buf, "gps", sizeof(boot_time_source_buf) - 1);
    boot_time_source_buf[sizeof(boot_time_source_buf) - 1] = '\0';
    if (source) *source = "gps";
    return last_fresh_gps_epoch;
  }
#endif
  if (last_fresh_gps_epoch_valid) {
    if (source) *source = "uptime";
    return last_fresh_gps_epoch + ((now_ms - last_fresh_gps_millis) / 1000UL);
  }
  if (source) *source = "none";
  return 0;
}

uint32_t heap_free_now() {
#if defined(ARDUINO_ARCH_ESP32)
  return _HAL_freeHeap(MALLOC_CAP_INTERNAL);
#else
  return _HAL_freeHeap();
#endif
}

uint32_t heap_max_block_now() {
#if defined(ARDUINO_ARCH_ESP32)
  return _HAL_maxHeapBlock(MALLOC_CAP_INTERNAL);
#else
  return _HAL_maxHeapBlock();
#endif
}

uint32_t heap_min_block_now() {
#if defined(ARDUINO_ARCH_ESP32)
  return _HAL_minHeapBlock(MALLOC_CAP_INTERNAL);
#else
  return _HAL_minHeapBlock();
#endif
}

uint32_t i2c_slow_total() {
  uint32_t total = 0;
  for (size_t i = 0; i < num_i2c_buses; i++) total += i2c_slow_count[i];
  return total;
}

