kebasaa/datalogger_esp8266/src/dl_core.h
uint32_t i2c_error_total() {
  uint32_t total = 0;
  for (size_t i = 0; i < num_i2c_buses; i++) total += i2c_error_count[i];
  return total;
}

uint32_t i2c_recovery_total() {
  uint32_t total = 0;
  for (size_t i = 0; i < num_i2c_buses; i++) total += i2c_recovery_count[i];
  return total;
}

void build_data_header() {
  CsvBuffer header;
  csv_init(header, data_header, sizeof(data_header));
  csv_append_raw(header, "boot_id,sample_counter,uptime_ms,timestamp_boot_ms,reset_reason,boot_time_source,rtc_time_valid,supervisor_restart_reason,");
#if USE_GPS
  csv_append_raw(header, "gps_date_valid,gps_time_fresh,gps_time_sane,gps_location_valid,gps_location_fresh,gps_chars_processed,gps_age_ms,gps_location_age_ms,gps_stale_count,gps_recovery_count,gps_poll_timeout_count,gps_i2c_recovery_count,gps_quarantine_active,gps_quarantine_count,gps_rejected_time_count,timestamp_utc,timestamp_calc_utc,timestamp_calc_source,lat,lon,alt,nb_sat,HDOP,");
#endif
#if USE_BATTERY
  csv_append_raw(header, "bat.mV,bat.perc,");
#endif

  // Type-major: for each sensor type, one column group per instance, suffixed
  // with the multiplexer channel (.b<N>). This order MUST match the data-row
  // order emitted in dl_sampling.h::processDataBuffered.
#if USE_ADS1115
  for (size_t i = 0; i < ADS_COUNT; ++i) {
    unsigned b = ads_buses[i];
    csv_appendf(header, "Sin.W_m2.b%u,Sout.W_m2.b%u,", b, b);
  }
#endif
#if USE_BME280
  for (size_t i = 0; i < BME_COUNT; ++i) {
    unsigned b = bme_buses[i];
    csv_appendf(header, "bme_T.C.b%u,bme_RH.perc.b%u,bme_P.Pa.b%u,bme_H2O.mmol_mol.b%u,", b, b, b, b);
  #if USE_CAL
    csv_appendf(header, "bme_T.C.cal.b%u,bme_T.flag.b%u,bme_P.Pa.cal.b%u,bme_P.flag.b%u,bme_H2O.mmol_mol.cal.b%u,bme_H2O.mmol_mol.flag.b%u,bme_RH.perc.cal.b%u,bme_RH.flag.b%u,", b, b, b, b, b, b, b, b);
  #else
    csv_appendf(header, "bme_T.C.b%u,bme_RH.perc.b%u,bme_P.Pa.b%u,bme_H2O.mmol_mol.b%u,", b, b, b, b);
  #endif
  }
#endif
#if USE_SCD30
  for (size_t i = 0; i < SCD_COUNT; ++i) {
    unsigned b = scd_buses[i];
    csv_appendf(header, "scd_T.C.b%u,scd_RH.perc.b%u,scd_CO2.ppm.b%u,", b, b, b);
  #if USE_CAL
    csv_appendf(header, "scd_CO2.ppm.cal.b%u,scd_CO2.flag.b%u,", b, b);
  #else
    csv_appendf(header, "scd_CO2.ppm.b%u,", b);
  #endif
  }
#endif
#if USE_SEN0465
  for (size_t i = 0; i < SEN_COUNT; ++i) {
    unsigned b = sen_buses[i];
    csv_appendf(header, "sen_T.C.b%u,sen_O2.mmol_mol.b%u,sen_raw_V.b%u,", b, b, b);
  #if USE_CAL
    csv_appendf(header, "sen_O2.mmol_mol.cal.b%u,sen_O2.flag.b%u,", b, b);
  #else
    csv_appendf(header, "sen_O2.mmol_mol.b%u,", b);
  #endif
  }
#endif
#if USE_MLX90614
  for (size_t i = 0; i < MLX_COUNT; ++i) {
    unsigned b = mlx_buses[i];
    csv_appendf(header, "mlx_T.C.b%u,mlx_obj_T.C.b%u,", b, b);
  }
#endif
  csv_append_raw(header, "free_heap,max_heap_block,min_heap_block,i2c_slow_count,i2c_error_count,i2c_recovery_count,");
  for (size_t i = 0; i < num_i2c_buses; i++) {
    unsigned b = i2c_buses[i];
    csv_appendf(header, "i2c_bus%u_error_count,i2c_bus%u_consecutive_error_count,i2c_bus%u_recovery_count,", b, b, b);
  }
  csv_append_raw(header, "valid_sensor_value_count,missing_sensor_value_count,critical_sensor_loss_count,gps_i2c_hard_fault_count,supervisor_reset_count,");
  csv_append_raw(header, "write_status,");
  data_header_ready = !header.truncated;
}

// ---------------------------------------------------------------------------
//  I2C bus health
//
//  The ESP8266 bit-bangs I2C in software, so every bit-wait can burn up to the
//  clock-stretch limit while a slave holds SCL low. Three of the sensor drivers
//  (SparkFun_I2C_GPS, DFRobot_MultiGasSensor and Adafruit_I2CDevice) call
//  Wire.begin() from their own init(), and twi_init() resets that limit to the
//  150 ms core default every time - so setting it once next to the first
//  Wire.begin() achieves nothing by the time sampling starts. It has to be
//  re-applied after the LAST sensor has initialised, and after every recovery.
// ---------------------------------------------------------------------------
void dl_i2c_apply_limits() {
#if defined(ARDUINO_ARCH_ESP8266)
  Wire.setClockStretchLimit(I2C_CLOCK_STRETCH_US);
#endif
}

// Clock a slave off the bus if it is mid-transaction, then issue a STOP.
// Wire.begin() cannot do this on its own: it only re-runs pinMode(), so a slave
// left holding SDA by a reset stays stuck across every subsequent reboot - the
// ESP resets, its sensors do not - and only removing power clears it.
// Returns false if the bus is still unusable afterwards.
bool dl_i2c_bus_recover() {
  pinMode(SDA, INPUT_PULLUP);
  pinMode(SCL, INPUT_PULLUP);
  delayMicroseconds(5);

  // Nothing a master can do about this one: we drive SCL, so if it reads low
  // something else is holding it down and only a power cycle will help.
  if (digitalRead(SCL) == LOW) return false;
  if (digitalRead(SDA) == HIGH) return true;      // already idle

  // Nine clocks is enough for a slave to finish any byte it thinks it is sending.
  for (int i = 0; i < 9 && digitalRead(SDA) == LOW; ++i) {
    pinMode(SCL, OUTPUT);
    digitalWrite(SCL, LOW);
    delayMicroseconds(5);
    pinMode(SCL, INPUT_PULLUP);                   // released, so stretching still works
    delayMicroseconds(5);
  }
  bool freed = digitalRead(SDA) == HIGH;

  // STOP condition: SDA rises while SCL is high.
  pinMode(SDA, OUTPUT);
  digitalWrite(SDA, LOW);
  delayMicroseconds(5);
  pinMode(SDA, INPUT_PULLUP);
  delayMicroseconds(5);
  return freed;
}

// Full bus reset: unstick, re-init the peripheral, restore the stretch limit.
bool dl_i2c_bus_reset() {
  bool ok = dl_i2c_bus_recover();
#if defined(ARDUINO_ARCH_ESP32) || defined(ARDUINO_ARCH_RP2040)
  Wire.end();
#endif
  Wire.begin();
  dl_i2c_apply_limits();
  return ok;
}

void recoverI2C(size_t pos) {
  mp.disableAllBuses();
  dl_i2c_bus_reset();
  // A glitched multiplexer has to be brought back too, otherwise every channel
  // switch below silently addresses nothing.
  mp.init();
  uint8_t ch = i2c_buses[pos];
  // Re-init every sensor wired to this channel. MLX and ADS are intentionally
  // omitted, matching the original behaviour (MLX has no meaningful re-init;
  // ADS shares a single global driver object).
#if USE_BME280
  for (size_t i = 0; i < BME_COUNT; ++i) if (bme_buses[i] == ch) bme_sensors[i]->init();
#endif
#if USE_SCD30
  for (size_t i = 0; i < SCD_COUNT; ++i) if (scd_buses[i] == ch && scd_sensors[i]->init()) {
    scd_sensors[i]->enable_self_calibration(false);
    scd_sensors[i]->set_interval(2);
  }
#endif
#if USE_SEN0465
  for (size_t i = 0; i < SEN_COUNT; ++i) if (sen_buses[i] == ch) sen_sensors[i]->init();
#endif
  mp.disableAllBuses();
  // The driver init()s above call Wire.begin() internally, which puts the stretch
  // limit back to the 150 ms default. Restore it or the next stuck device stalls
  // the loop for seconds.
  dl_i2c_apply_limits();
  i2c_recovery_count[pos]++;
  i2c_last_recovery_ms[pos] = millis();
  i2c_recovery_status_pending = true;
}

void record_i2c_health(size_t bus_index, uint32_t elapsed_ms, bool error_seen) {
  if (elapsed_ms > I2C_SLOW_THRESHOLD_MS) i2c_slow_count[bus_index]++;
  if (error_seen || elapsed_ms > I2C_SLOW_THRESHOLD_MS) {
    if (i2c_consecutive_error_count[bus_index] == 0) i2c_error_count[bus_index]++;
    i2c_consecutive_error_count[bus_index]++;
  } else {
    i2c_consecutive_error_count[bus_index] = 0;
    return;
  }
  uint32_t now_ms = millis();
  if (i2c_consecutive_error_count[bus_index] >= I2C_RECOVERY_CONSECUTIVE_ERRORS &&
      (i2c_last_recovery_ms[bus_index] == 0 || now_ms - i2c_last_recovery_ms[bus_index] >= I2C_RECOVERY_COOLDOWN_MS)) {
    recoverI2C(bus_index);
  }
}

bool isGPSDateValid();
bool isGPSTimeFresh();
bool isGPSLocationFresh();
void recoverGPS();

