kebasaa/datalogger_esp8266/src/dl_core.h
uint16_t write_status_row(const char* event, uint16_t related_write_status) {
#if USE_MICROSD
  if (!gps_boot_locked || last_valid_gps_date[0] == '\0') return MicroSD::WRITE_CARD_MISSING;
  char status_fn[32];
  const char* status_file_date = timestamp_file_date_buf[0] ? timestamp_file_date_buf : last_valid_gps_date;
  snprintf(status_fn, sizeof(status_fn), "status_%s.csv", status_file_date);
  const char* status_header =
    "event,boot_id,sample_counter,uptime_ms,reset_reason,free_heap,max_heap_block,min_heap_block,"
    "boot_time_source,rtc_time_valid,supervisor_restart_reason,"
    "gps_date_valid,gps_time_fresh,gps_time_sane,gps_location_valid,gps_location_fresh,gps_stale_count,gps_recovery_count,"
    "gps_poll_timeout_count,gps_i2c_recovery_count,gps_quarantine_active,gps_quarantine_count,gps_rejected_time_count,"
    "valid_sensor_value_count,missing_sensor_value_count,critical_sensor_loss_count,gps_i2c_hard_fault_count,supervisor_reset_count,"
    "i2c_error_count,i2c_recovery_count,related_write_status,card_missing_count,header_open_fail_count,"
    "append_open_fail_count,print_fail_count,flush_fail_count,close_fail_count,";
  CsvBuffer row;
  csv_init(row, status_row_buf, sizeof(status_row_buf));
  csv_field(row, event);
  csv_uint(row, boot_id);
  csv_uint(row, sample_counter);
  csv_uint(row, millis() - boot_ms);
  csv_field(row, reset_reason_buf);
  csv_uint(row, heap_free_now());
  csv_uint(row, heap_max_block_now());
  csv_uint(row, heap_min_block_now());
  csv_field(row, boot_time_source_buf);
  csv_int(row, rtc_time_valid ? 1 : 0);
  csv_field(row, supervisor_restart_reason_buf);
#if USE_GPS
  csv_int(row, isGPSDateValid() ? 1 : 0);
  csv_int(row, isGPSTimeFresh() ? 1 : 0);
  csv_int(row, gps_time_sane ? 1 : 0);
  csv_int(row, gps.locationValid() ? 1 : 0);
  csv_int(row, isGPSLocationFresh() ? 1 : 0);
  csv_uint(row, gps_stale_count);
  csv_uint(row, gps_recovery_count);
  csv_uint(row, gps_poll_timeout_count);
  csv_uint(row, gps_i2c_recovery_count);
  csv_int(row, gps_quarantine_active ? 1 : 0);
  csv_uint(row, gps_quarantine_count);
  csv_uint(row, gps_rejected_time_count);
#else
  csv_int(row, 0);
  csv_int(row, 0);
  csv_int(row, 0);
  csv_int(row, 0);
  csv_int(row, 0);
  csv_uint(row, 0);
  csv_uint(row, 0);
  csv_uint(row, 0);
  csv_uint(row, 0);
  csv_int(row, 0);
  csv_uint(row, 0);
  csv_uint(row, 0);
#endif
  csv_uint(row, valid_sensor_value_count);
  csv_uint(row, missing_sensor_value_count);
  csv_uint(row, critical_sensor_loss_count);
  csv_uint(row, gps_i2c_hard_fault_count);
  csv_uint(row, supervisor_reset_count);
  csv_uint(row, i2c_error_total());
  csv_uint(row, i2c_recovery_total());
  csv_uint(row, related_write_status);
  csv_uint(row, sd.cardMissingCount());
  csv_uint(row, sd.headerOpenFailCount());
  csv_uint(row, sd.appendOpenFailCount());
  csv_uint(row, sd.printFailCount());
  csv_uint(row, sd.flushFailCount());
  csv_uint(row, sd.closeFailCount());
  return sd.write_data(status_fn, status_header, status_row_buf, 86400);
#else
  return 0;
#endif
}

bool isGPSDateValid() {
    #if USE_GPS
        if (!gps.dateValid()) return false;
        int year = gps.year();
        return (year >= GPS_YEAR_MIN) && (year <= GPS_YEAR_MAX);
    #else
        return false; // Or true, depending on if you want to proceed without GPS
    #endif
}

bool isGPSTimeFresh() {
    #if USE_GPS
        return isGPSDateValid() && gps.timeValid() && gps.gpsAgeMs() <= GPS_FRESH_MAX_AGE_MS;
    #else
        return false;
    #endif
}

bool isGPSTimeSane(uint32_t now_ms) {
    #if USE_GPS
        if (!isGPSTimeFresh()) return false;
        return is_gps_epoch_sane(gps_epoch_now(), now_ms);
    #else
        (void)now_ms;
        return false;
    #endif
}

bool isGPSLocationFresh() {
    #if USE_GPS
        return gps.locationValid() && gps.locationAgeMs() <= GPS_FRESH_MAX_AGE_MS;
    #else
        return false;
    #endif
}

void recoverGPS() {
    #if USE_GPS
        // Do not reset Wire or the multiplexer here: GPS is on the direct bus
        // and a shared-bus reset can make otherwise healthy sensors disappear.
        gps.init();
        gps_recovery_count++;
        gps_i2c_recovery_count++;
        last_gps_recovery_ms = millis();
        gps_i2c_recovery_status_pending = true;
    #endif
}

void count_sensor_value(float value, uint32_t& valid_count, uint32_t& missing_count) {
  if (isnan(value)) missing_count++;
  else valid_count++;
}

bool all_i2c_buses_degraded() {
  if (num_i2c_buses == 0) return false;   // a sensorless build must not trip the supervisor
  for (size_t i = 0; i < num_i2c_buses; i++) {
    if (i2c_consecutive_error_count[i] == 0) return false;
  }
  return true;
}

void start_gps_quarantine(uint32_t now_ms) {
  gps_quarantine_active = true;
  gps_quarantine_until_ms = now_ms + GPS_QUARANTINE_MS;
  gps_quarantine_count++;
  gps_i2c_quarantine_status_pending = true;
#if I2C_MULTI
  mp.disableAllBuses();
#endif
}

void update_gps_quarantine(uint32_t now_ms) {
  if (gps_quarantine_active && (int32_t)(now_ms - gps_quarantine_until_ms) >= 0) {
    gps_quarantine_active = false;
  }
}

bool activate_rtc_boot_time(uint32_t now_ms) {
  if (!rtc_time_valid || gps_boot_locked) return false;
  last_fresh_gps_epoch = rtc_boot_epoch;
  last_fresh_gps_millis = boot_ms;
  last_fresh_gps_epoch_valid = true;
  gps_boot_locked = true;
  boot_time_from_rtc = true;
  strncpy(boot_time_source_buf, "rtc", sizeof(boot_time_source_buf) - 1);
  boot_time_source_buf[sizeof(boot_time_source_buf) - 1] = '\0';
  format_utc_date(rtc_boot_epoch + ((now_ms - boot_ms) / 1000UL), last_valid_gps_date, sizeof(last_valid_gps_date));
  boot_time_from_rtc_status_pending = true;
  return true;
}

void update_sensor_supervisor(uint32_t now_ms) {
  bool all_sensor_loss = all_i2c_buses_degraded() && valid_sensor_value_count == 0;
  bool gps_i2c_hard_fault = gps_quarantine_active && all_sensor_loss;
  if (gps_i2c_hard_fault) {
    if (gps_i2c_hard_fault_count == 0) sensor_data_lost_status_pending = true;
    gps_i2c_hard_fault_count++;
  } else {
    gps_i2c_hard_fault_count = 0;
  }

  if (gps_i2c_hard_fault_count >= GPS_I2C_HARD_FAULT_SAMPLES && gps_boot_locked) {
    supervisor_reset_count++;
    last_supervisor_reset_ms = now_ms;
    strncpy(supervisor_restart_reason_buf, "gps_i2c_hard_fault", sizeof(supervisor_restart_reason_buf) - 1);
    supervisor_restart_reason_buf[sizeof(supervisor_restart_reason_buf) - 1] = '\0';
    supervisor_restart_pending = true;
    supervisor_restart_status_pending = true;
    return;
  }

  bool critical_loss = all_sensor_loss;
  if (critical_loss) {
    if (critical_sensor_loss_count == 0) sensor_data_lost_status_pending = true;
    critical_sensor_loss_count++;
  } else {
    critical_sensor_loss_count = 0;
    return;
  }

  if (critical_sensor_loss_count < CRITICAL_SENSOR_LOSS_SAMPLES) return;
  if (!gps_boot_locked) return;
  if ((now_ms - boot_ms) < SUPERVISOR_MIN_UPTIME_MS) return;
  if (last_supervisor_reset_ms != 0 && (now_ms - last_supervisor_reset_ms) < SUPERVISOR_RESTART_COOLDOWN_MS) return;

  supervisor_reset_count++;
  last_supervisor_reset_ms = now_ms;
  strncpy(supervisor_restart_reason_buf, "sensor_loss", sizeof(supervisor_restart_reason_buf) - 1);
  supervisor_restart_reason_buf[sizeof(supervisor_restart_reason_buf) - 1] = '\0';
  supervisor_restart_pending = true;
  supervisor_restart_status_pending = true;
}

void onWiFiConnect() {
	Serial.printf("Wifi connected");
	Serial.printf("IP4 Address: %s\n",WiFi.localIP().toString().c_str());
	WiFiValid = true;
#if USE_HTTPREQ
	h4.queueFunction(HTTPClient);
	httpReqTimer = h4.every(60000, HTTPClient);
#endif
}
void onWiFiDisconnect() {
	Serial.printf("WiFi Disconnected\n");
#if USE_HTTPREQ
	h4.cancel(httpReqTimer);
#endif
}
#if USE_MQTT
void onMQTTConnect() {
	mqttSender = h4.every(2000, []()
					  {
						  publishDevice("heap", _HAL_freeHeap());
						  publishDevice("uptime",h4p.gvGetstring(upTimeTag()));
						  publishDevice("maxbloc",_HAL_maxHeapBlock());
					  });
	
	bigSender = h4.every(3000,[]{
		Serial.printf("SENDING BIG\n");
		h4mqtt.publish("big", &big[0], BIG_SIZE, 1);
	});
}
void onMQTTDisconnect() {
	Serial.printf("onMQTTDisconnect()\n");
	h4.cancel(mqttSender);
	h4.cancel(bigSender);
}
#endif
